# Classifying

In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

In [2]:
cones = Table().with_columns(
    'Flavor', make_array('strawberry', 'chocolate', 'chocolate', 'strawberry', 'chocolate'),
    'Price', make_array(3.55, 4.75, 6.55, 5.25, 5.25)
)
cones

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 6.55
strawberry | 5.25
chocolate  | 5.25

In [3]:
# Default behavior is to count the number of 
# occurrences of each category
cones.group('Flavor')

Flavor     | count
chocolate  | 3
strawberry | 2

In [12]:
# Optionally, you can specify any function you want to see a different 
# characteristic of the categories.
# This computes the most expensive ice cream in each category
cones.group('Flavor', max)

Flavor     | Price max
chocolate  | 6.55
strawberry | 5.25

In [11]:
# This computes the average of all prices in the category
cones.group('Flavor', np.average)

Flavor     | Price average
chocolate  | 5.51667
strawberry | 4.4

In [45]:
nba = Table.read_table('nba_salaries.csv')
nba

rank | name             | position | team                   | salary   | season
1    | Shaquille O'Neal | C        | Los Angeles Lakers     | 17142000 | 2000
2    | Kevin Garnett    | PF       | Minnesota Timberwolves | 16806000 | 2000
3    | Alonzo Mourning  | C        | Miami Heat             | 15004000 | 2000
4    | Juwan Howard     | PF       | Washington Wizards     | 15000000 | 2000
5    | Scottie Pippen   | SF       | Portland Trail Blazers | 14795000 | 2000
6    | Karl Malone      | PF       | Utah Jazz              | 14000000 | 2000
7    | Larry Johnson    | F        | New York Knicks        | 11910000 | 2000
8    | Gary Payton      | PG       | Seattle SuperSonics    | 11020000 | 2000
9    | Rasheed Wallace  | PF       | Portland Trail Blazers | 10800000 | 2000
10   | Shawn Kemp       | C        | Cleveland Cavaliers    | 10780000 | 2000
... (9446 rows omitted)

# Practice 1
Find the total amount of money each team paid out in salaries.
(Start by selecting only the columns you need.)

In [48]:
teams = nba.select('salary', 'team')
teams.group('team', np.sum)
teams

salary   | team
17142000 | Los Angeles Lakers
16806000 | Minnesota Timberwolves
15004000 | Miami Heat
15000000 | Washington Wizards
14795000 | Portland Trail Blazers
14000000 | Utah Jazz
11910000 | New York Knicks
11020000 | Seattle SuperSonics
10800000 | Portland Trail Blazers
10780000 | Cleveland Cavaliers
... (9446 rows omitted)

# Practice 2
Find the average salary earned by players in each position. (Start by selecting only the columns you need.)

In [49]:
positions = nba.select('position', 'salary')
positions.group('position', np.average)
positions

position | salary
C        | 17142000
PF       | 16806000
C        | 15004000
PF       | 15000000
SF       | 14795000
PF       | 14000000
F        | 11910000
PG       | 11020000
PF       | 10800000
C        | 10780000
... (9446 rows omitted)

# Classifying by multiple variables

In [50]:
more_cones = Table().with_columns(
    'Flavor', make_array('strawberry', 'chocolate', 'chocolate', 'strawberry', 'chocolate', 'bubblegum'),
    'Color', make_array('pink', 'light brown', 'dark brown', 'pink', 'dark brown', 'pink'),
    'Price', make_array(3.55, 4.75, 5.25, 5.25, 5.25, 4.75)
)

more_cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [51]:
# Can provide a list of multiple categories to group by
more_cones.group(['Flavor', 'Color'])

Flavor     | Color       | count
bubblegum  | pink        | 1
chocolate  | dark brown  | 2
chocolate  | light brown | 1
strawberry | pink        | 2

In [52]:
# Just like with a single variable, you can provide 
# a function to look at a different characteristic
more_cones.group(['Flavor', 'Color'], max)

Flavor     | Color       | Price max
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 5.25

# Practice 3
Find the total paid in salaries by each team *during each season*. (Start by selecting only the columns you need.)

In [67]:
total = nba.select('team', 'season', 'salary')
total.group(['team', 'season'], np.sum)
total

team                   | season | salary
Los Angeles Lakers     | 2000   | 17142000
Minnesota Timberwolves | 2000   | 16806000
Miami Heat             | 2000   | 15004000
Washington Wizards     | 2000   | 15000000
Portland Trail Blazers | 2000   | 14795000
Utah Jazz              | 2000   | 14000000
New York Knicks        | 2000   | 11910000
Seattle SuperSonics    | 2000   | 11020000
Portland Trail Blazers | 2000   | 10800000
Cleveland Cavaliers    | 2000   | 10780000
... (9446 rows omitted)